#+BEGIN_SRC emacs-lisp :exports none :results silent
  (setq org-babel-inline-result-wrap "\\(%s\\)")
#+END_SRC


#+BEGIN_SRC python :results output :session subjectdata :exports none :tangle yes
import os as OS
OS.chdir(OS.read(OS.open('homedir.txt', OS.O_RDONLY), 1000).strip())
import numpy as NP
import pandas as PD

n_iterations = 16384 # 32768

parameters = {'bodymass': 'kg', 'leg_m': 'm', 'bmi': 'kg/m'}

subject_data = PD.read_csv(f'models/proportions/bodyproportions_{n_iterations}_data.csv', sep = ';').set_index('Unnamed: 0', inplace = False)

# re-transform logged parameters
for col in parameters.keys():
    if col not in subject_data.columns:
        subject_data.loc[:, col] = NP.exp(subject_data[f'l{col}'].values)

# print (subject_data.head(3).T)
subject_data.index.name = 'idx'
ageclass_averages = subject_data.groupby('ageclass').agg({param: NP.nanmean for param in parameters.keys()})

sex_counts = subject_data.groupby(['sex', 'ageclass']).size().unstack('ageclass').fillna(0).astype(int)

ageclasses = ['infant', 'adolescent', 'adult']
GetBMData = lambda ac, bm: ageclass_averages.loc[ac, bm]
GetAgewiseBM = lambda param, fmtstr = "{:0.1f}": '/'.join( \
                                                           [fmtstr.format(GetBMData(ac, param)) \
                                                            for ac in ageclasses] \
                                                          ) \
                                                + '\ ' + parameters[param]
# print(GetAgewiseBM('bmi'))
GetFilteredCount = lambda cat, val: subject_data.loc[subject_data[cat] == val, :].shape[0]
#+END_SRC

#+RESULTS:



** Bodymass is Age-Dependant (Surprise!)
:PROPERTIES:
:CUSTOM_ID: bodymass:results
:END:

#+BEGIN_SRC python :results output :exports none :session bmresults :tangle yes
import os as OS
OS.chdir(OS.read(OS.open('homedir.txt', OS.O_RDONLY), 1000).strip())
import numpy as NP
import pandas as PD

n_iterations = 16384

results_all = PD.read_csv(f'models/proportions/bodyproportions_{n_iterations}.csv', sep = ';') \
            .set_index(['effect'], inplace = False) \
            .loc[:, ['mean', 'hdi_3%', 'hdi_97%']]

results = results_all.loc[[\
                       idx for idx in results_all.index.values \
                       if (idx == 'dof') \
                          or (idx == 'packed_cholesky_stds[0]') \
                          or ('[0,0]' in idx) \
            ], :]
results.index = [idx.replace('[0,0]', '').replace('[0]', '') \
                 for idx in results.index.values]

results_retrafo = PD.DataFrame(index = results.index, columns = results.columns)
ref_value = results.loc['intercept', 'mean']
ReTraFo = lambda val: NP.exp(val + ref_value) - NP.exp(ref_value)
for idx, row in results.iterrows():
    if idx == 'intercept':
        results_retrafo.loc[idx, :] = NP.exp(row.values)
        continue
    elif idx in ['dof', 'packed_cholesky_corr']:
        results_retrafo.loc[idx, :] = row.values
        continue

    results_retrafo.loc[idx, :] = ReTraFo(row.values)

# results_retrafo.loc[:, :] = NP.round(results_retrafo.loc[:,:].values, 2)

# work on transformed results
results = results_retrafo

translator = { \
                 'intercept': '\(\\alpha\)' \
               , 'sex_is_male': '\(\\beta_{male}\)' \
               , 'ageclass_is_adolescent': '\(\\beta_{adol}\)' \
               , 'ageclass_is_infant': '\(\\beta_{inft}\)' \
               , 'packed_cholesky_stds': '\(\\epsilon\)' \
               , 'dof': '\(\\nu\)' \
             }

parameters = [k for k in translator.keys()]
results = results.loc[parameters, :]
# print (results)

GetMean = lambda param: '\({:+0.1f}\)'.format(results.loc[param, 'mean'])
GetHDI = lambda param: '\(\\left({:+0.1f}, {:+0.1f}\\right)\)'.format(*results.loc[param, ['hdi_3%', 'hdi_97%']])
GetSig = lambda param: '*' if 'beta' in translator[param] and ((results.loc[param, 'hdi_3%'] * results.loc[param, 'hdi_97%']) > 0) else ' '

results_table = { \
                  '': ['' for param in parameters] \
                 , '*parameter*': [translator[param] for param in parameters] \
                 , '*value*': [GetMean(param) for param in parameters] \
                 , '*interval*': [GetHDI(param) for param in parameters] \
                 , '*sig.*': [GetSig(param) for param in parameters] \
                }

table_list = PD.DataFrame.from_dict(results_table) \
                      .to_markdown(index = False) \
                      .replace(':', '-') \
                      .replace('-|-', '-+-') \
                      .split('\n')
out_table = \
          '\n'.join( [ '|--+--+--+--+--|' \
                        , table_list[0] \
                        , '|   | <l> | <r> | <c> | <c> |'\
                        , '| / | <> | <> | <> | <> |'\
                     ]  \
                     + table_list[1:] \
                     + [ '|--+--+--+--+--|' \
                     ]
                      )

with open('figures/bm_results_detail.org', 'w') as fi:
    print (out_table, file = fi)

print (PD.DataFrame.from_dict(results_table).iloc[:, 1:] \
                      .to_markdown(index = False))
#+END_SRC

#+RESULTS:
: | *parameter*      | *value*   | *interval*                    | *sig.*   |
: |:-----------------|:----------|:------------------------------|:---------|
: | \(\alpha\)       | \(+12.3\) | \(\left(+10.2, +14.8\right)\) |          |
: | \(\beta_{male}\) | \(+0.6\)  | \(\left(-1.9, +3.7\right)\)   |          |
: | \(\beta_{adol}\) | \(-2.4\)  | \(\left(-4.6, +0.4\right)\)   |          |
: | \(\beta_{inft}\) | \(-9.4\)  | \(\left(-10.1, -8.6\right)\)  | *        |
: | \(\epsilon\)     | \(+2.6\)  | \(\left(+1.7, +3.8\right)\)   |          |
: | \(\nu\)          | \(+52.1\) | \(\left(+15.1, +94.0\right)\) |          |


#+CAPTION: Results of the Bodymass Model.
#+LABEL: tab:bodyproportions
#+INCLUDE: "../figures/bm_results_detail.org"


As expected, bodymass and ageclass are associated (Tab. \ref{tab:bodyproportions}).
On average, adolescents are src_python[:session bmresults]{f"{-results.loc['ageclass_is_adolescent', 'mean']:.1f}\ kg"} {{{results(\(2.4\ kg\))}}} and infants are src_python[:session bmresults]{f"{-results.loc['ageclass_is_infant', 'mean']:.1f}\ kg"} {{{results(\(9.4\ kg\))}}} lighter than adult individuals.
The effect of an animal being infant is deemed relevant because the credible interval does not include zero.
The credible interval is the smallest possible value range to contain \(94\ \%\) of the values, i.e. from \(3\ \%\) to \(97\ \%\) quantile of the samples; termed "highest (probability) density interval" or HDI.
That interval is comparable to the "standard error of the mean" of a given slope, and has to be seen in relation to the intercept and model residual to judge if an effect is large or small, i.e. relevant or not.
The difference for the adolescent group exemplifies this: it is in the order of the \(\epsilon\), and the HDI contains zero.
Although we know that adolescents weigh less than adults, the data set is insufficient and effect size too low to give waterproof statistics.

In contrast to age, sex seems to have no effect on bodymass (keeping in mind that there are generally few and no adult males in the sample; slope: src_python[:session bmresults]{f"{results.loc['sex_is_male', 'mean']:+.1f}\ [{results.loc['sex_is_male', 'hdi_3%']:+.1f}, {results.loc['sex_is_male', 'hdi_97%']:+.1f}]\ kg"} {{{results(\(+0.6\ [-1.9\, +3.7]\ kg\))}}} ).

Finally, the parameter \(\nu\) ("nu") deserves some explanation, to demonstrate another neat modeling trick.
An often disputed, but indispensible assumption in conventional statistics is the Normality Assumption (i.e. that values of a variable are normally distributed).
Likewise, in probabilistic modeling, one can choose the distribution /type/ (e.g. Normal) of a model parameter, which together with the distribution /properties/ (e.g. \(\mu = 0\), \(\sigma = 1\)) is the *prior* for that parameter.
Distribution properties are adjusted in MCMC sampling, and the prior only influences the result when sample size is very small.
In contrast, the distribution type stays fixed and has major influence on the outcome.
Hence, choosing a Normal here might need some justification.
Part of that justification comes from model comparison (see ch. \ref{workflow:comparison}).
But in case of the Normal distribution, we can use a more general distribution (Student's T) to actually measure how "Normal" our data is.
Student's T has an extra parameter, which is \(\nu\) or the "degree of freedom".
The larger \(\nu\), the higher the resemblance to a Normal distribution.
In contrast, on lower \(\nu\) values, Student's T has more "weight in the tails", accounting for "outliers" which are unnormally far from the mean.
For our bodymass model, the sampler converged at src_python[:session bmresults]{f"\\nu = {results.loc['dof', 'mean']:.1f}"} {{{results(\(\nu = 52.1\))}}}.
This is a relatively high value, confirming that bodymass is approximately normally distributed.
Usually, model comparison favors the use of a Normal posterior in such cases.


